balazsgrill/modembed/pic/core/hu.modembed.pic.ui/device-descriptors/18xxxx/PIC18F65J50.PIC
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="SPBRG1" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="SPBRG1" edc:nzwidth="0x8" edc:por="00000000">
          <edc:AliasList>
            <edc:LegacyAlias edc:cname="SPBRG"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SPBRG1" edc:desc="" edc:islanghidden="true" edc:mask="0xff" edc:name="SPBRG1" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="ECCP3CON" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="ECCP3CON" edc:nzwidth="0x8" edc:por="00000000">
          <edc:AliasList>
            <edc:LegacyAlias edc:cname="CCP3CON"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CCP3M" edc:desc="" edc:mask="0xf" edc:name="CCP3M" edc:nzwidth="0x4"/>
              <edc:SFRFieldDef edc:cname="DC3B" edc:desc="" edc:mask="0x3" edc:name="DC3B" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="P3M" edc:desc="" edc:mask="0x3" edc:name="P3M" edc:nzwidth="0x2"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="CCP3M0" edc:desc="" edc:mask="0x1" edc:name="CCP3M0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CCP3M1" edc:desc="" edc:mask="0x1" edc:name="CCP3M1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CCP3M2" edc:desc="" edc:mask="0x1" edc:name="CCP3M2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CCP3M3" edc:desc="" edc:mask="0x1" edc:name="CCP3M3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DC3B0" edc:desc="" edc:mask="0x1" edc:name="DC3B0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DC3B1" edc:desc="" edc:mask="0x1" edc:name="DC3B1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="P3M0" edc:desc="" edc:mask="0x1" edc:name="P3M0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="P3M1" edc:desc="" edc:mask="0x1" edc:name="P3M1" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:AdjustPoint edc:offset="4"/>
              <edc:SFRFieldDef edc:cname="CCP3Y" edc:desc="" edc:mask="0x1" edc:name="CCP3Y" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CCP3X" edc:desc="" edc:mask="0x1" edc:name="CCP3X" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:JoinedSFRDef edc:cname="CCPR3" edc:desc="" edc:name="CCPR3" edc:nzwidth="0x10">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CCPR3" edc:desc="" edc:mask="0xffff" edc:name="CCPR3" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="" edc:stimtype="Record"/>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="CCPR3L" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="CCPR3L" edc:nzwidth="0x8" edc:por="xxxxxxxx">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="CCPR3L" edc:desc="" edc:islanghidden="true" edc:mask="0xff" edc:name="CCPR3L" edc:nzwidth="0x8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
            <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Integer"/>
          </edc:SFRDef>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="CCPR3H" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="CCPR3H" edc:nzwidth="0x8" edc:por="xxxxxxxx">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="CCPR3H" edc:desc="" edc:islanghidden="true" edc:mask="0xff" edc:name="CCPR3H" edc:nzwidth="0x8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
            <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Integer"/>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="ECCP3DEL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="ECCP3DEL" edc:nzwidth="0x8" edc:por="00000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PDC" edc:desc="" edc:mask="0x7f" edc:name="PDC" edc:nzwidth="0x7"/>
              <edc:SFRFieldDef edc:cname="PRSEN" edc:desc="" edc:mask="0x1" edc:name="PRSEN" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="PDC0" edc:desc="" edc:mask="0x1" edc:name="PDC0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PDC1" edc:desc="" edc:mask="0x1" edc:name="PDC1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PDC2" edc:desc="" edc:mask="0x1" edc:name="PDC2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PDC3" edc:desc="" edc:mask="0x1" edc:name="PDC3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PDC4" edc:desc="" edc:mask="0x1" edc:name="PDC4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PDC5" edc:desc="" edc:mask="0x1" edc:name="PDC5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PDC6" edc:desc="" edc:mask="0x1" edc:name="PDC6" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="P3DC0" edc:desc="" edc:mask="0x1" edc:name="P3DC0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="P3DC1" edc:desc="" edc:mask="0x1" edc:name="P3DC1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="P3DC2" edc:desc="" edc:mask="0x1" edc:name="P3DC2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="P3DC3" edc:desc="" edc:mask="0x1" edc:name="P3DC3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="P3DC4" edc:desc="" edc:mask="0x1" edc:name="P3DC4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="P3DC5" edc:desc="" edc:mask="0x1" edc:name="P3DC5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="P3DC6" edc:desc="" edc:mask="0x1" edc:name="P3DC6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="P3RSEN" edc:desc="" edc:mask="0x1" edc:name="P3RSEN" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="ECCP3AS" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="ECCP3AS" edc:nzwidth="0x8" edc:por="00000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PSSBD" edc:desc="" edc:mask="0x3" edc:name="PSSBD" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="PSSAC" edc:desc="" edc:mask="0x3" edc:name="PSSAC" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="ECCPAS" edc:desc="" edc:mask="0x7" edc:name="ECCPAS" edc:nzwidth="0x3"/>
              <edc:SFRFieldDef edc:cname="ECCPASE" edc:desc="" edc:mask="0x1" edc:name="ECCPASE" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="PSSBD0" edc:desc="" edc:mask="0x1" edc:name="PSSBD0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PSSBD1" edc:desc="" edc:mask="0x1" edc:name="PSSBD1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PSSAC0" edc:desc="" edc:mask="0x1" edc:name="PSSAC0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PSSAC1" edc:desc="" edc:mask="0x1" edc:name="PSSAC1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ECCPAS0" edc:desc="" edc:mask="0x1" edc:name="ECCPAS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ECCPAS1" edc:desc="" edc:mask="0x1" edc:name="ECCPAS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ECCPAS2" edc:desc="" edc:mask="0x1" edc:name="ECCPAS2" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="PSS3BD0" edc:desc="" edc:mask="0x1" edc:name="PSS3BD0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PSS3BD1" edc:desc="" edc:mask="0x1" edc:name="PSS3BD1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PSS3AC0" edc:desc="" edc:mask="0x1" edc:name="PSS3AC0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PSS3AC1" edc:desc="" edc:mask="0x1" edc:name="PSS3AC1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ECCP3AS0" edc:desc="" edc:mask="0x1" edc:name="ECCP3AS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ECCP3AS1" edc:desc="" edc:mask="0x1" edc:name="ECCP3AS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ECCP3AS2" edc:desc="" edc:mask="0x1" edc:name="ECCP3AS2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ECCP3ASE" edc:desc="" edc:mask="0x1" edc:name="ECCP3ASE" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="ECCP2CON" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="ECCP2CON" edc:nzwidth="0x8" edc:por="00000000">
          <edc:AliasList>
            <edc:LegacyAlias edc:cname="CCP2CON"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CCP2M" edc:desc="" edc:mask="0xf" edc:name="CCP2M" edc:nzwidth="0x4"/>
              <edc:SFRFieldDef edc:cname="DC2B" edc:desc="" edc:mask="0x3" edc:name="DC2B" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="P2M" edc:desc="" edc:mask="0x3" edc:name="P2M" edc:nzwidth="0x2"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="CCP2M0" edc:desc="" edc:mask="0x1" edc:name="CCP2M0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CCP2M1" edc:desc="" edc:mask="0x1" edc:name="CCP2M1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CCP2M2" edc:desc="" edc:mask="0x1" edc:name="CCP2M2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CCP2M3" edc:desc="" edc:mask="0x1" edc:name="CCP2M3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DC2B0" edc:desc="" edc:mask="0x1" edc:name="DC2B0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DC2B1" edc:desc="" edc:mask="0x1" edc:name="DC2B1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="P2M0" edc:desc="" edc:mask="0x1" edc:name="P2M0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="P2M1" edc:desc="" edc:mask="0x1" edc:name="P2M1" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:AdjustPoint edc:offset="4"/>
              <edc:SFRFieldDef edc:cname="CCP2Y" edc:desc="" edc:mask="0x1" edc:name="CCP2Y" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CCP2X" edc:desc="" edc:mask="0x1" edc:name="CCP2X" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
