balazsgrill/modembed/pic/core/hu.modembed.pic.ui/device-descriptors/18xxxx/PIC18F65J50.PIC
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="CM1CON1" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00011111" edc:name="CM1CON1" edc:nzwidth="0x8" edc:por="00011111">
          <edc:AliasList>
            <edc:LegacyAlias edc:cname="CM1CON"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CCH" edc:desc="" edc:mask="0x3" edc:name="CCH" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="CREF" edc:desc="" edc:mask="0x1" edc:name="CREF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EVPOL" edc:desc="" edc:mask="0x3" edc:name="EVPOL" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="CPOL" edc:desc="" edc:mask="0x1" edc:name="CPOL" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="COE" edc:desc="" edc:mask="0x1" edc:name="COE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CON" edc:desc="" edc:mask="0x1" edc:name="CON" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="C1CH0" edc:desc="" edc:mask="0x1" edc:name="C1CH0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="C1CH1" edc:desc="" edc:mask="0x1" edc:name="C1CH1" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="EVPOL0" edc:desc="" edc:mask="0x1" edc:name="EVPOL0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EVPOL1" edc:desc="" edc:mask="0x1" edc:name="EVPOL1" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="CCH0" edc:desc="" edc:mask="0x1" edc:name="CCH0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CCH1" edc:desc="" edc:mask="0x1" edc:name="CCH1" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:MuxedSFRDef edc:nzwidth="0x8">
          <edc:SelectSFR edc:when="($0xfc0 &amp; 0x10) == 0x10">
            <edc:SFRDef edc:access="n-nnnnnn" edc:cname="REFOCON" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0-000000" edc:name="REFOCON" edc:nmmrid="0x1" edc:nzwidth="0x8" edc:por="0-000000">
              <edc:SFRModeList>
                <edc:SFRMode edc:id="DS.0">
                  <edc:SFRFieldDef edc:cname="RODIV" edc:desc="" edc:mask="0xf" edc:name="RODIV" edc:nzwidth="0x4"/>
                  <edc:SFRFieldDef edc:cname="ROSEL" edc:desc="" edc:mask="0x1" edc:name="ROSEL" edc:nzwidth="0x1"/>
                  <edc:SFRFieldDef edc:cname="ROSSLP" edc:desc="" edc:mask="0x1" edc:name="ROSSLP" edc:nzwidth="0x1"/>
                  <edc:AdjustPoint edc:offset="1"/>
                  <edc:SFRFieldDef edc:cname="ROON" edc:desc="" edc:mask="0x1" edc:name="ROON" edc:nzwidth="0x1"/>
                </edc:SFRMode>
                <edc:SFRMode edc:id="LT.0">
                  <edc:SFRFieldDef edc:cname="RODIV0" edc:desc="" edc:mask="0x1" edc:name="RODIV0" edc:nzwidth="1"/>
                  <edc:SFRFieldDef edc:cname="RODIV1" edc:desc="" edc:mask="0x1" edc:name="RODIV1" edc:nzwidth="1"/>
                  <edc:SFRFieldDef edc:cname="RODIV2" edc:desc="" edc:mask="0x1" edc:name="RODIV2" edc:nzwidth="1"/>
                  <edc:SFRFieldDef edc:cname="RODIV3" edc:desc="" edc:mask="0x1" edc:name="RODIV3" edc:nzwidth="1"/>
                </edc:SFRMode>
              </edc:SFRModeList>
            </edc:SFRDef>
          </edc:SelectSFR>
          <edc:SelectSFR>
            <edc:SFRDef edc:access="nnnnr-nn" edc:cname="OSCCON" edc:desc="" edc:impl="0xfb" edc:isindirect="false" edc:isvolatile="true" edc:mclr="01101-00" edc:name="OSCCON" edc:nzwidth="0x8" edc:por="01101-00">
              <edc:AliasList/>
              <edc:SFRModeList>
                <edc:SFRMode edc:id="DS.0">
                  <edc:SFRFieldDef edc:cname="SCS" edc:desc="" edc:mask="0x3" edc:name="SCS" edc:nzwidth="0x2"/>
                  <edc:AdjustPoint edc:offset="1"/>
                  <edc:SFRFieldDef edc:cname="OSTS" edc:desc="" edc:mask="0x1" edc:name="OSTS" edc:nzwidth="0x1"/>
                  <edc:SFRFieldDef edc:cname="IRCF" edc:desc="" edc:mask="0x7" edc:name="IRCF" edc:nzwidth="0x3"/>
                  <edc:SFRFieldDef edc:cname="IDLEN" edc:desc="" edc:mask="0x1" edc:name="IDLEN" edc:nzwidth="0x1"/>
                </edc:SFRMode>
                <edc:SFRMode edc:id="LT.0">
                  <edc:SFRFieldDef edc:cname="SCS0" edc:desc="" edc:mask="0x1" edc:name="SCS0" edc:nzwidth="1"/>
                  <edc:SFRFieldDef edc:cname="SCS1" edc:desc="" edc:mask="0x1" edc:name="SCS1" edc:nzwidth="1"/>
                  <edc:AdjustPoint edc:offset="2"/>
                  <edc:SFRFieldDef edc:cname="IRCF0" edc:desc="" edc:mask="0x1" edc:name="IRCF0" edc:nzwidth="1"/>
                  <edc:SFRFieldDef edc:cname="IRCF1" edc:desc="" edc:mask="0x1" edc:name="IRCF1" edc:nzwidth="1"/>
                  <edc:SFRFieldDef edc:cname="IRCF2" edc:desc="" edc:mask="0x1" edc:name="IRCF2" edc:nzwidth="1"/>
                </edc:SFRMode>
              </edc:SFRModeList>
              <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
            </edc:SFRDef>
          </edc:SelectSFR>
        </edc:MuxedSFRDef>
        <edc:AdjustPoint edc:offset="1"/>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="T0CON" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="11111111" edc:name="T0CON" edc:nzwidth="0x8" edc:por="11111111">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="T0PS" edc:desc="" edc:mask="0x7" edc:name="T0PS" edc:nzwidth="0x3"/>
              <edc:SFRFieldDef edc:cname="PSA" edc:desc="" edc:mask="0x1" edc:name="PSA" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T0SE" edc:desc="" edc:mask="0x1" edc:name="T0SE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T0CS" edc:desc="" edc:mask="0x1" edc:name="T0CS" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T08BIT" edc:desc="" edc:mask="0x1" edc:name="T08BIT" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR0ON" edc:desc="" edc:mask="0x1" edc:name="TMR0ON" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="T0PS0" edc:desc="" edc:mask="0x1" edc:name="T0PS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T0PS1" edc:desc="" edc:mask="0x1" edc:name="T0PS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T0PS2" edc:desc="" edc:mask="0x1" edc:name="T0PS2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T0PS3" edc:desc="" edc:mask="0x1" edc:name="T0PS3" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:JoinedSFRDef edc:cname="TMR0" edc:desc="" edc:name="TMR0" edc:nzwidth="0x10">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TMR0" edc:desc="" edc:mask="0xffff" edc:name="TMR0" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="" edc:stimtype="Record"/>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="TMR0L" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="TMR0L" edc:nzwidth="0x8" edc:por="xxxxxxxx">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="TMR0L" edc:desc="" edc:islanghidden="true" edc:mask="0xff" edc:name="TMR0L" edc:nzwidth="0x8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
            <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Integer"/>
          </edc:SFRDef>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="TMR0H" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="TMR0H" edc:nzwidth="0x8" edc:por="00000000">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="TMR0H" edc:desc="" edc:islanghidden="true" edc:mask="0xff" edc:name="TMR0H" edc:nzwidth="0x8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
            <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Integer"/>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
